Revit 2026 API

# MEPSectionRoughness Property

---

The roughness of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Roughness { get; }
```
```vb
Public ReadOnly Property Roughness As Double
	Get
```
```cpp
public:
property double Roughness {
	double get ();
}
```
```fsharp
member Roughness : float with get
```

#### Property Value

Double

In one section, all section members have same roughness. Default unit is Decimal feet. For Duct, unit type is UT_HVAC_Roughness. For Pipe, unit type is UT_Piping_Roughness

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace